Documents/ЗапросАкцизныхМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ЗапросАкцизныхМарокЕГАИС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАкцизнойМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>68</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПодключаемыеКомандыКлиент/Ext/Module.bsl
/////////////////////////////////////////////////////////////////////
//
// Адаптационный модуль. При необходимости здесь можно реализовать 
//  переход на используемую библиотеку.
//
/////////////////////////////////////////////////////////////////////

Процедура НачатьОбновлениеКоманд(Форма) Экспорт
КонецПроцедуры

Процедура ВыполнитьКоманду(Форма, Команда, Объект) Экспорт
	
	Если ТипЗнч(Форма) =Тип("УправляемаяФорма") Тогда
		
		ИмяФормы = Форма.ИмяФормы;
		
		Если СтрНайти(ИмяФормы, "ЗапросАкцизныхМарокЕГАИС") > 0 Тогда
			
			ИмяМакета = "АкцизныеМарки";
			
			КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
			КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
			КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
			КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
			КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
			КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
			
			СтрокаКоллекцииПечатныхФорм = КоллекцияПечатныхФорм.Добавить();
			СтрокаКоллекцииПечатныхФорм.ИмяВРЕГ = ВРег(ИмяМакета);
			
			МассивОбъектов = Новый Массив;
			
			Если СтрНайти(ИмяФормы, "Списка") = 0 Тогда
				МассивОбъектов.Добавить(Объект.Ссылка);
			Иначе
				МассивОбъектов = Новый Массив;
				Для каждого СтрокаСписка Из Объект.ВыделенныеСтроки Цикл
					МассивОбъектов.Добавить(СтрокаСписка);
				КонецЦикла;
			КонецЕсли;
			
			Документы.ЗапросАкцизныхМарокЕГАИС.Печать(МассивОбъектов,
				Неопределено,
				КоллекцияПечатныхФорм,
				Неопределено,
				Неопределено);
			
			СтрокаКоллекцииПечатныхФорм = КоллекцияПечатныхФорм.Найти(ВРег(ИмяМакета), "ИмяВРЕГ");
			Если СтрокаКоллекцииПечатныхФорм <> Неопределено Тогда
				УниверсальныеМеханизмы.НапечататьДокумент(СтрокаКоллекцииПечатныхФорм.ТабличныйДокумент,,, "Штрихкоды упаковок");
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ИмяФормы, "ШтрихкодыУпаковокТоваров") > 0 Тогда
			
			Если СтрНайти(ИмяФормы, "Списка") = 0 Тогда
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("ТипШтрихкода",   Объект.ТипШтрихкода);
				ПараметрыШтрихкода.Вставить("Штрихкод",       Объект.ЗначениеШтрихкода);
				ПараметрыШтрихкода.Вставить("Номенклатура",   Объект.Номенклатура);
				ПараметрыШтрихкода.Вставить("Характеристика", Объект.Характеристика);
				ПараметрыШтрихкода.Вставить("ДатаМаркировки", Объект.ДатаУпаковки);
				
				ОбъектыПечати = Новый Массив;
				ОбъектыПечати.Добавить(ПараметрыШтрихкода);
			Иначе
				
				ОбъектыПечати = Новый Массив;
				Для каждого СтрокаСписка Из Объект.ВыделенныеСтроки Цикл
					
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("ТипШтрихкода",   СтрокаСписка.ТипШтрихкода);
					ПараметрыШтрихкода.Вставить("Штрихкод",       СтрокаСписка.ЗначениеШтрихкода);
					ПараметрыШтрихкода.Вставить("Номенклатура",   СтрокаСписка.Номенклатура);
					ПараметрыШтрихкода.Вставить("Характеристика", СтрокаСписка.Характеристика);
					ПараметрыШтрихкода.Вставить("ДатаМаркировки", СтрокаСписка.ДатаУпаковки);
					
					ОбъектыПечати.Добавить(ПараметрыШтрихкода);
				КонецЦикла;
			КонецЕсли;
			
			ШтрихкодыУпаковокКлиентПереопределяемый.ПечатьШтрихкодовУпаковок(ОбъектыПечати, Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
